; domain
(define (domain driverlog)
      (:requirements :typing :fluents) 
      (:types           location locatable - object
    		driver truck obj - locatable)
    
      (:predicates 
    		(at ?obj - locatable ?loc - location)
    		(in ?obj1 - obj ?obj - truck)
    		(driving ?d - driver ?v - truck)
    		(link ?x ?y - location) (path ?x ?y - location)
    		(empty ?v - truck)
    )
      (:functions 	(time-to-walk ?l1 ?l2 - location)
    		(time-to-drive ?l1 ?l2 - location)
    		(fuel-used)
    		(fuel-per-minute ?t - truck)
    		(load ?t - truck)
      )
    
    
    (:action LOAD-TRUCK
      :parameters
       (?obj - obj
        ?truck - truck
        ?loc - location)
      :precondition
       (and (at ?truck ?loc) (at ?obj ?loc))
      :effect
       (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
    		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))
    
    (:action UNLOAD-TRUCK
      :parameters
       (?obj - obj
        ?truck - truck
        ?loc - location)
      :precondition
       (and (at ?truck ?loc) (in ?obj ?truck))
      :effect
       (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
    		(decrease (fuel-per-minute ?truck) (load ?truck))))
    
    
    (:action BOARD-TRUCK
      :parameters
       (?driver - driver
        ?truck - truck
        ?loc - location)
      :precondition
       (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
      :effect
       (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))
    
    (:action DISEMBARK-TRUCK
      :parameters
       (?driver - driver
        ?truck - truck
        ?loc - location)
      :precondition
       (and (at ?truck ?loc) (driving ?driver ?truck))
      :effect
       (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))
    
    (:action DRIVE-TRUCK
      :parameters
       (?truck - truck
        ?loc-from - location
        ?loc-to - location
        ?driver - driver)
      :precondition
       (and (at ?truck ?loc-from)
       (driving ?driver ?truck) (link ?loc-from ?loc-to))
      :effect
       (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
    		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))
    
    (:action WALK
      :parameters
       (?driver - driver
        ?loc-from - location
        ?loc-to - location)
      :precondition
       (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
      :effect
       (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-2)
	(:domain driverlog)
	
	(:objects
    	driver1 - driver
    	driver2 - driver
    	driver3 - driver
    	truck1 - truck
    	truck2 - truck
    	truck3 - truck
    	package1 - obj
    	package2 - obj
    	package3 - obj
    	s0 - location
    	s1 - location
    	s2 - location
    	s3 - location
	)
	
	(:init
	    ;for drive1, package1, truck1
    	(at driver1 s0)
    	(at truck1 s0)
	    (empty truck1)
	    (= (load truck1) 0)
	    (= (fuel-per-minute truck1) 10)
	    (at package1 s0)
	    
	    ;for drive2, package2, truck2
    	(at driver2 s0)
    	(at truck2 s0)
	    (empty truck2)
	    (= (load truck2) 0)
	    (= (fuel-per-minute truck2) 10)
	    (at package2 s0)
	    
	    ;for drive3, package3, truck3
    	(at driver3 s0)
	    (at truck3 s0)
	    (empty truck3)
	    (= (load truck3) 0)
	    (= (fuel-per-minute truck3) 10)
    	(at package3 s0)
	
	    ;linking locations
	    ;s0 and s1
    	(link s0 s1)
    	(link s1 s0)
    	(= (time-to-drive s0 s1) 70)
    	(= (time-to-drive s1 s0) 70)
        ;s0 and s2
    	(link s0 s2)
    	(link s2 s0)
    	(= (time-to-drive s0 s2) 47)
    	(= (time-to-drive s2 s0) 47)
    	;s1 and s2
    	(link s2 s1)
    	(link s1 s2)
    	(= (time-to-drive s2 s1) 24)
    	(= (time-to-drive s1 s2) 24)
    	;s0 and s3
    	(link s0 s3)
    	(link s3 s0)
    	(= (time-to-drive s3 s0) 15)
    	(= (time-to-drive s0 s3) 15)
    	;s2 and s3
    	(link s2 s3)
    	(link s3 s2)
    	(= (time-to-drive s3 s2) 50)
    	(= (time-to-drive s2 s3) 50)
    	;s1 and s2
    	(link s1 s3)
    	(link s3 s1)
    	(= (time-to-drive s3 s1) 30)
    	(= (time-to-drive s1 s3) 30)
	    (= (fuel-used) 0)
    )

	(:goal (and
    	(at driver1 s1)
    	(at truck1 s1)
    	(at package1 s1)
    	(at driver2 s2)
    	(at truck2 s2)
    	(at package2 s2)
    	(at driver3 s3)
    	(at truck3 s3)
    	(at package3 s3)
	))

    (:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 0 of 9
2. (drive-truck truck3 s0 s3 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (fuel-used) from 0 to 150
   goals met: 1 of 9
3. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 9
4. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 2 of 9
5. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 9
6. (load-truck package1 truck2 s0)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 9
7. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 150 to 920
   goals met: 2 of 9
8. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 9
9. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 9
10. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 9
11. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 920 to 1531
   goals met: 3 of 9
12. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 9
13. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 1531 to 1771
   goals met: 5 of 9
14. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 6 of 9
15. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 6 of 9
16. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 6 of 9
17. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 9
18. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 9
19. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 1771 to 2321
   goals met: 6 of 9
20. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 9
21. (drive-truck truck1 s3 s1 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 2321 to 2621
   goals met: 8 of 9
22. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 9 of 9
